#!/bin/bash
#
#********************************************************************
#Author:           YiLing Wu (hj)
#email:            huangjing510@126.com
#Date:             2023-12-23
#FileName:         ssh_check.bash
#URL:              http://42.194.242.109:510/
#Description:      通过SSH批量在多台服务器上执行命令，适用于自动化任务，例如检查服务器状态、更新配置或管理服务
#Copyright (C):    2024 All rights reserved
#********************************************************************
#
# Usage: bash ssh_check.bash "ls /home"   # 在所有服务器上列出 /home 目录

# 目标服务器的 IP 列表
ip_list="192.168.10.7 192.168.10.31 192.168.10.41 192.168.10.51"

# 输出批量操作的提示信息
echo '--------------------------------------------'
echo '批量执行命令'
echo '--------------------------------------------'

# 遍历每个 IP 并执行传入的命令
for ip in $ip_list
do
  ssh root@$ip $@
done
